# a = 0
# #[1,60,30,90.100,20,70.59.69.71,80,84]
# for i in [1,60,30,90,100,20,70,59,69,71,80,84]:
#     if(i < 60):
#         a = 0
#     if(60<= i <= 70):
#         a = 1
#     if(70< i <= 80):
#         a = 2
#     if(i > 80):
#         a = 3
# if(a == 0):
#     print(i,"不及格")
# if(a == 1):
#     print(i,"及格")
# if(a == 2):
#     print(i,"良好")
# if(a == 3):
#     print(i,"优秀")
#
# a = 0 #a表示0
# b = 0 #b表示1
# #"01010010001110001001001010101010010101" 计算下几个0 几个1
# c ="01010010001110001001001010101010010101"
# for i in c:
#     if(i == "0"):
#         a =a + 1
#     elif(i == "1"):
#         b =b + 1
# print("有",a,"个0","有",b,"个1")
#
# #求1+2+3+4...+100
# f=0
# for i in range(1,101):
#     f = f+i
# print(f)
# #
# e = 1
# i = 1
# while(i<11):
#     e = e*i
#     i = i+1
# print(e)


#

a ="flsafeojafkjsdoaefjsoafiuealfdosajfpow"
print(a[0:8])
print(a[-6:-1])


