# #print python 的一个输出函数，会把括号内的内容输出到控制台
# #print（）这样的写法，我们就叫做这是一个方法，括号内的内容，我们叫做参数列表、
# #变量的特性
# #变量名只能用字母和下划线开头。
# # 先创建变量，后使用变量。
#
# print("hello world,你好，世界")
# # a代表变量名，=赋值符，表示把右边的值存到左边的变量
# # 字符串有四种表示方法，"第一种表示方法"'第二种表示方法'，三个单引号第三种方法，三个双引号第四种方法，（str）
# a = "dfjowfjdsl"
# print(type(a))
# print(a)
# #代表数字，用（int）表示
# b = 123456
# print(type(b))
# print(b)
# # []表示list，代表一个列表，可以存多个数据。数据与数据间用“,”隔开。
# c = [1,2,45,89]
# print(type(c))
# print(c)
# # （）表示tuple,代表一个元组，可以存多个数据。数据与数据间用“,”隔开。
# d = (1,2,3,4)
# print(type(d))
# print(d)
# # 键值对数据  姓名：张三，性别：男，手机：13545678978
# # {}表示dict,代表一个字典，可以存储多个键值对数据，多个键值对中间用“,”隔开，key 和 velues 之间用":"隔开。
# e = {"姓名":"张三","性别":"男","手机":"13545678978"}
# print(type(e))
# print(e)
#
#
# # 练习
# # 第一组数据  张三，李四，王五，赵六，钱七
# f = ["张三","李四","王五","赵六","钱七"]
# print(type(f))
# print(f)
# # 第二组数据  姓名张三  年龄18 性别 女  科目 语文  成绩 80
# g = {"姓名":"张三","年龄":18,"性别":"女","科目":"语文","成绩":80}
# print(type(g))
# print(g)
# # 第三组数据  A，2,3,4,5,6,7,8,9 J,K,Q
# H = ("A","2","3","4","5","6","7","8","9","J","K","Q")
# print(type(H))
# print(H)
# # 第四组数据  10000
# J = 10000
# print(type(J))
# print(J)
# # 第五组数据  学生
# K = "学生"
# print(type(K))
# print(K)
#
#
# # 小明有20块钱，红双喜10块钱，玉溪25块钱，大前门5块钱   求出小明可以买那种烟
#
# a = 20
# if (a>=10):
#     print(a, "元能买红双喜")
# if (a>=5):
#     print(a,"元能买大前门")
# if (a>=25):
#     print(a,"元能买玉溪")
#
#
# # 成人票 200 未成年票100 60岁以上的老人票 150 小明今年18岁，去买票应该买那种票？
#
# b = 18
# if (b>=18):
#     print(b,"可以买成人票")
# elif (b>60):
#     print(b,"可以买老人票")
# else:
#     print(b, "可以买未成年票")


#
# for i in range (1,10):
#     for j in range (1,i+1):
#         print(i,'x',j,'=',i*j,'\t',end='')
#     print()


#
# a = 1
# for i in [90, 100, 81, 84,65]:
#     if(i < 80):
#         a = 1
# if(a == 1):
#     print("全部优秀")
# else:
# #     print("不全优秀")
# a = 0
# b = 0
# #"01010010001110001001001010101010010101" 计算下几个0 几个1
# d ="01010010001110001001001010101010010101"
# for i in d:
#     if(i =="0"):
#         a = a + 1
#     if(i == "1"):
#         b = b + 1
# print("有",a,"个0","有",b,"个1")
#
# a = 0
# b = 1
#
# #求1+2+3+4...+100
# for i in(1,101)
#



# #求1+2+3+4...+100
k = 0
i = 1
while(i<101):
    k = k + i
    i = i + 1
print(k)